const lang = {
  HOME: 'Главная',
  BOOKMARKS: 'Сохраненные статьи',
  BUTTON_AUTH: 'Авторизоваться',
  BUTTON_SHOW_MORE: 'Показать еще',
  BUTTON_LOGIN: 'Войти',
  BUTTON_REGISTER: 'Зарегистрироваться',
  BUTTON_LOGOUT: 'Выйти',
  HERO: 'Что творится в мире?',
  HERO_DESCRIPTION:
  'Находите самые свежие статьи на любую тему и сохраняйте в своём личном кабинете.',
  SEARCH_BUTTON: 'Искать',
  SEARCH_PLACEHOLDER: 'Введите тему новости',
  SEARCH_RESULT: 'Результаты поиска',
  SEARCH_NOT_FOUND: 'Ничего не найдено',
  ABOUT: 'Об авторе',
  ABOUT_TEXT: [
    'Этот проект написал талантливый кот Саймон, первый кот-разработчик в мире.'
    + 'Саймон владеет технологиями веб-разработки в широком диапазоне на стороне'
    + 'фронт- и бэкенда, такими, например, как JavaScript, React, Node, Express,'
    + 'MongoDB, но при этом мало ест и не требователен к условиям работы.',
    'За кошачьи годы обучения в Яндекс.Практикуме Саймон усвоил суровые'
    + 'истины мира технологий, и теперь готов помочь потенциальным заказчикам,'
    + 'взяв контроль над их офисом свои лапы.',
  ],
  TOOLTIP_TRASH: 'Убрать из сохраненных',
  TOOLTIP_ADD: 'Войдите, чтобы сохранять статьи',
  PRACTICUM: 'Яндекс.Практикум',
  TITLE_LOGIN: 'Вход',
  TITLE_REGISTER: 'Регистрация',
  TITLE_SUCCESS: 'Пользователь успешно зарегистрирован!',
  FORM_PASSWORD: 'Пароль',
  FORM_NAME: 'Имя',
  PLACEHOLDER_EMAIL: 'Введите почту',
  PLACEHOLDER_PASSWORD: 'Введите пароль',
  PLACEHOLDER_NAME: 'Введите имя',
};

const errors = {
  SEARCH: 'Нужно ввести ключевое слово',
};

export { lang, errors };
